In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [3]:
df

       name  math  english  reading classroom
0     Sally    62       85       80         A
1      Jane    88       79       67         B
2     Suzie    94       74       95         A
3     Billy    98       96       88         B
4       Ada    77       92       98         A
5      John    79       76       93         B
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
10    Isaac    92       99       93         B
11     Alan    92       62       72         A

In [2]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
data = np.array([[1, 2, 3], [4, 5, 6]])

pd.DataFrame(data, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

In [6]:
data

array([[1, 2, 3],
       [4, 5, 6]])

In [7]:
df.reading.agg('min')

67

In [10]:
df[['english', 'reading', 'math']].agg(['mean', 'min', 'max'])

        english  reading       math
mean  77.666667     86.5  84.833333
min   62.000000     67.0  62.000000
max   99.000000     98.0  98.000000

In [11]:
df.groupby('classroom').math.max()

classroom
A    94
B    98
Name: math, dtype: int64

In [16]:
more_data = np.array([[7, 8, 9], [10, 11, 12]])

new_df = pd.DataFrame(more_data)

new_df

    0   1   2
0   7   8   9
1  10  11  12

In [18]:
new_df.columns = ["a", "b", "c"]
new_df

    a   b   c
0   7   8   9
1  10  11  12

In [19]:
# iloc is the integer location and iloc can specify which number row

### File types

**.csv** stands for "comma separtated values" = spreadsheets
- datasets from a vendor

**.json** is a data interchange format
- stands for javascript object notation == exactly the same as python lists/dictionary syntax
- python dictionary == js object

When writing data, write to a csv for less duplication

In [20]:
from pydataset import data
mpg = data("mpg")

In [22]:
mpg.to_csv("mpg.csv")